<!doctype html>




<html class="theme-next mist">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Git,协议," />





  <link rel="alternate" href="/atom.xml" title="技术分享" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/upload/favicon.ico?v=5.0.1" />
  <link rel="icon" type="image/svg+xml" href="/upload/favicon.svg?v=5.0.1" />
  <link rel="alternate icon" type="image/png" href="/upload/favicon.png?v=5.0.1" />






<meta name="description" content="Git &amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;&amp;#x56DB;&amp;#x79CD;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#x6765;&amp;#x4F20;&amp;#x8F93;&amp;#x6570;&amp;#x636E;&amp;#xFF1A;&amp;#x672C;&amp;#x5730;&amp;#x4F20;&amp;#x8F93;&amp;#xFF0C;SSH &amp;#x534F;&amp;#x8BAE;">
<meta property="og:type" content="article">
<meta property="og:title" content="Git传输协议介绍">
<meta property="og:url" content="http://blog.kuleyang.com/2016/04/28/Git传输协议介绍/index.html">
<meta property="og:site_name" content="技术分享">
<meta property="og:description" content="Git &amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;&amp;#x56DB;&amp;#x79CD;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#x6765;&amp;#x4F20;&amp;#x8F93;&amp;#x6570;&amp;#x636E;&amp;#xFF1A;&amp;#x672C;&amp;#x5730;&amp;#x4F20;&amp;#x8F93;&amp;#xFF0C;SSH &amp;#x534F;&amp;#x8BAE;">
<meta property="og:updated_time" content="2016-04-27T19:20:05.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Git传输协议介绍">
<meta name="twitter:description" content="Git &amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;&amp;#x56DB;&amp;#x79CD;&amp;#x4E3B;&amp;#x8981;&amp;#x7684;&amp;#x534F;&amp;#x8BAE;&amp;#x6765;&amp;#x4F20;&amp;#x8F93;&amp;#x6570;&amp;#x636E;&amp;#xFF1A;&amp;#x672C;&amp;#x5730;&amp;#x4F20;&amp;#x8F93;&amp;#xFF0C;SSH &amp;#x534F;&amp;#x8BAE;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: false,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> Git传输协议介绍 | 技术分享 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?94f2a8bbfb8374b1e513b6e1759bb48f";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">技术分享</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">一点一滴</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-mygithub">
          <a href="https://github.com/kuleyang" rel="section">
            
              <i class="menu-item-icon fa fa-github fa-fw"></i> <br />
            
            我的github
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Git传输协议介绍
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-04-28T03:09:27+08:00" content="2016-04-28">
              2016-04-28
            </time>
          </span>

          
		
		  <span id="qrcode">
		  </span>
        
          
            
              <span class="post-comments-count">
                <a href="/2016/04/28/Git传输协议介绍/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/04/28/Git传输协议介绍/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>Git &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x56DB;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x534F;&#x8BAE;&#x6765;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF1A;&#x672C;&#x5730;&#x4F20;&#x8F93;&#xFF0C;SSH &#x534F;&#x8BAE;&#xFF0C;Git &#x534F;&#x8BAE;&#x548C; HTTP &#x534F;&#x8BAE;&#x3002;&#x4E0B;&#x9762;&#x5206;&#x522B;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x54EA;&#x4E9B;&#x60C5;&#x5F62;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#xFF08;&#x6216;&#x907F;&#x514D;&#x4F7F;&#x7528;&#xFF09;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x9664;&#x4E86; HTTP &#x534F;&#x8BAE;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x534F;&#x8BAE;&#x90FD;&#x8981;&#x6C42;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5B89;&#x88C5;&#x5E76;&#x8FD0;&#x884C; Git&#x3002;</p>
<a id="more"></a>
<h3 id="&#x672C;&#x5730;&#x534F;&#x8BAE;"><a href="#&#x672C;&#x5730;&#x534F;&#x8BAE;" class="headerlink" title="&#x672C;&#x5730;&#x534F;&#x8BAE;"></a>&#x672C;&#x5730;&#x534F;&#x8BAE;</h3><p>&#x6700;&#x57FA;&#x672C;&#x7684;&#x5C31;&#x662F;<em>&#x672C;&#x5730;&#x534F;&#x8BAE;&#xFF08;Local protocol&#xFF09;</em>&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x5728;&#x8BE5;&#x534F;&#x8BAE;&#x4E2D;&#x7684;&#x8868;&#x793A;&#xFF0C;&#x5C31;&#x662F;&#x786C;&#x76D8;&#x4E0A;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x3002;&#x8FD9;&#x5E38;&#x89C1;&#x4E8E;&#x56E2;&#x961F;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x90FD;&#x5BF9;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982; NFS&#xFF09;&#x62E5;&#x6709;&#x8BBF;&#x95EE;&#x6743;&#xFF0C;&#x6216;&#x8005;&#x6BD4;&#x8F83;&#x5C11;&#x89C1;&#x7684;&#x591A;&#x4EBA;&#x5171;&#x7528;&#x540C;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x540E;&#x9762;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x5B9E;&#x4F8B;&#x90FD;&#x50A8;&#x5B58;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x91CC;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x707E;&#x96BE;&#x6027;&#x6570;&#x636E;&#x635F;&#x5931; &#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x514B;&#x9686;&#x4ED3;&#x5E93;&#xFF0C;&#x63A8;&#x9001;&#x548C;&#x83B7;&#x53D6;&#x3002;&#x514B;&#x9686;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x8DEF;&#x5F84;&#x4F5C;&#x4E3A; URL &#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ git clone /opt/git/project.git</span><br></pre></td></tr></table></figure>
<p>&#x6216;&#x8005;&#x8FD9;&#x6837;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ git clone file:///opt/git/project.git</span><br></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x5728; URL &#x5F00;&#x5934;&#x660E;&#x786E;&#x4F7F;&#x7528; <code>file://</code> &#xFF0C;&#x90A3;&#x4E48; Git &#x4F1A;&#x4EE5;&#x4E00;&#x79CD;&#x7565;&#x5FAE;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x7ED9;&#x51FA;&#x8DEF;&#x5F84;&#xFF0C;Git &#x4F1A;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x786C;&#x94FE;&#x63A5;&#x6216;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x5B83;&#x6240;&#x9700;&#x8981;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86;<code>file://</code> &#xFF0C;Git &#x4F1A;&#x8C03;&#x7528;&#x5B83;&#x5E73;&#x65F6;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x6765;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x5DE5;&#x5E8F;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x6548;&#x7387;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#x3002;&#x4F7F;&#x7528; <code>file://</code> &#x524D;&#x7F00;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0D;&#x5305;&#x542B;&#x65E0;&#x5173;&#x5F15;&#x7528;&#x6216;&#x5BF9;&#x8C61;&#x7684;&#x5E72;&#x51C0;&#x4ED3;&#x5E93;&#x526F;&#x672C;&#x7684;&#x65F6;&#x5019; &#x2014; &#x4E00;&#x822C;&#x6307;&#x4ECE;&#x5176;&#x4ED6;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x5BFC;&#x5165;&#x7684;&#xFF0C;&#x6216;&#x7C7B;&#x4F3C;&#x60C5;&#x5F62;&#xFF08;&#x53C2;&#x89C1;&#x7B2C; 9 &#x7AE0;&#x7684;&#x7EF4;&#x62A4;&#x4EFB;&#x52A1;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x8DEF;&#x5F84;&#xFF0C;&#x8FD9;&#x6837;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x4F5C;&#x4E3A;&#x73B0;&#x6709; Git &#x9879;&#x76EE;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ git remote add local_proj /opt/git/project.git</span><br></pre></td></tr></table></figure>
<p>&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x50CF;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x4E00;&#x6837;&#x5411;&#x8FD9;&#x4E2A;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x63A8;&#x9001;&#x548C;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x4E86;&#x3002;</p>
<h4 id="&#x4F18;&#x70B9;"><a href="#&#x4F18;&#x70B9;" class="headerlink" title="&#x4F18;&#x70B9;"></a>&#x4F18;&#x70B9;</h4><p>&#x57FA;&#x4E8E;&#x6587;&#x4EF6;&#x4ED3;&#x5E93;&#x7684;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#x5B83;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x7559;&#x4E86;&#x73B0;&#x5B58;&#x6587;&#x4EF6;&#x7684;&#x6743;&#x9650;&#x548C;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x4F53;&#x5171;&#x4EAB;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5EFA;&#x7ACB;&#x4ED3;&#x5E93;&#x5C31;&#x5341;&#x5206;&#x5BB9;&#x6613;&#x4E86;&#x3002;&#x4F60; &#x53EA;&#x9700;&#x628A;&#x4E00;&#x4EFD;&#x88F8;&#x4ED3;&#x5E93;&#x7684;&#x526F;&#x672C;&#x653E;&#x5728;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x8BBF;&#x95EE;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x7136;&#x540E;&#x50CF;&#x5BF9;&#x5176;&#x4ED6;&#x5171;&#x4EAB;&#x76EE;&#x5F55;&#x4E00;&#x6837;&#x8BBE;&#x7F6E;&#x8BFB;&#x5199;&#x6743;&#x9650;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x201C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x90E8;&#x7F72; Git &#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;&#x88F8;&#x4ED3;&#x5E93;&#x7684;&#x526F;&#x672C;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x4ECE;&#x522B;&#x4EBA;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x4E2D;&#x83B7;&#x53D6;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x7684;&#x5FEB;&#x6377;&#x65B9;&#x6CD5;&#x3002;&#x5047;&#x5982;&#x4F60;&#x548C;&#x4F60;&#x7684;&#x540C;&#x4E8B;&#x5728;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x5408;&#x4F5C;&#xFF0C;&#x4ED6;&#x4EEC;&#x60F3;&#x8BA9;&#x4F60;&#x68C0;&#x51FA;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD0;&#x884C;&#x7C7B;&#x4F3C; <code>git pull /home/john/project</code> &#x901A;&#x5E38;&#x4F1A;&#x6BD4;&#x4ED6;&#x4EEC;&#x63A8;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x4F60;&#x518D;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x53D6;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x3002;</p>
<h4 id="&#x7F3A;&#x70B9;"><a href="#&#x7F3A;&#x70B9;" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h4><p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x4E0E;&#x57FA;&#x672C;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x8BBF;&#x95EE;&#x76F8;&#x6BD4;&#xFF0C;&#x96BE;&#x4EE5;&#x63A7;&#x5236;&#x4ECE;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x6765;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4ECE;&#x5BB6;&#x91CC;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x4E0A;&#x63A8;&#x9001;&#xFF0C;&#x5C31;&#x8981;&#x5148;&#x6302;&#x8F7D;&#x8FDC;&#x7A0B;&#x786C;&#x76D8;&#xFF0C;&#x8FD9;&#x548C;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x8BBF;&#x95EE;&#x76F8;&#x6BD4;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x548C;&#x7F13;&#x6162;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x662F;&#x8BE5;&#x65B9;&#x6CD5;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x662F;&#x6700;&#x5FEB;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5BF9;&#x4E8E;&#x5171;&#x4EAB;&#x6302;&#x8F7D;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x53EA;&#x6709;&#x5728;&#x4F60;&#x5BF9;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x5FEB;&#x7684;&#x65F6;&#x5019;&#x624D;&#x5FEB;&#x3002;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E8C;&#x8005;&#x540C;&#x65F6;&#x5141;&#x8BB8; Git &#x8BBF;&#x95EE;&#x672C;&#x5730;&#x786C;&#x76D8;&#xFF0C;&#x901A;&#x8FC7; NFS &#x8BBF;&#x95EE;&#x4ED3;&#x5E93;&#x901A;&#x5E38;&#x4F1A;&#x6BD4; SSH &#x6162;&#x3002;</p>
<h3 id="SSH-&#x534F;&#x8BAE;"><a href="#SSH-&#x534F;&#x8BAE;" class="headerlink" title="SSH &#x534F;&#x8BAE;"></a>SSH &#x534F;&#x8BAE;</h3><p>Git &#x4F7F;&#x7528;&#x7684;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x53EF;&#x80FD;&#x5C31;&#x662F; SSH &#x4E86;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x73AF;&#x5883;&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x901A;&#x8FC7; SSH &#x5BF9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BBF;&#x95EE; &#x2014; &#x5373;&#x4FBF;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x67B6;&#x8BBE;&#x8D77;&#x6765;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x3002;SSH &#x4E5F;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x540C;&#x65F6;&#x652F;&#x6301;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3002;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF08;HTTP &#x548C; Git&#xFF09;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x867D;&#x7136;&#x4E8C;&#x8005;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x53EF;&#x7528;&#xFF0C;&#x4F46;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#x8FD8;&#x662F;&#x9700;&#x8981; SSH&#x3002;SSH &#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x6388;&#x6743;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF1B;&#x800C;&#x56E0;&#x4E3A;&#x5176;&#x666E;&#x904D;&#x6027;&#xFF0C;&#x4E00;&#x822C;&#x67B6;&#x8BBE;&#x548C;&#x4F7F;&#x7528;&#x90FD;&#x5F88;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x901A;&#x8FC7; SSH &#x514B;&#x9686;&#x4E00;&#x4E2A; Git &#x4ED3;&#x5E93;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x7ED9;&#x51FA; <code>ssh://</code> &#x7684; URL&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ git clone ssh://user@server:project.git</span><br></pre></td></tr></table></figure>
<p>&#x6216;&#x8005;&#x4E0D;&#x6307;&#x660E;&#x67D0;&#x4E2A;&#x534F;&#x8BAE; &#x2014; &#x8FD9;&#x65F6; Git &#x4F1A;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528; SSH &#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ git clone user@server:project.git</span><br></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x4E0D;&#x6307;&#x660E;&#x7528;&#x6237;&#xFF0C;Git &#x4F1A;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x767B;&#x5F55;&#x7684;&#x7528;&#x6237;&#x540D;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<h4 id="&#x4F18;&#x70B9;-1"><a href="#&#x4F18;&#x70B9;-1" class="headerlink" title="&#x4F18;&#x70B9;"></a>&#x4F18;&#x70B9;</h4><p>&#x4F7F;&#x7528; SSH &#x7684;&#x597D;&#x5904;&#x6709;&#x5F88;&#x591A;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x62E5;&#x6709;&#x5BF9;&#x7F51;&#x7EDC;&#x4ED3;&#x5E93;&#x7684;&#x5199;&#x6743;&#x9650;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x4E0D;&#x4F7F;&#x7528; SSH&#x3002;&#x5176;&#x6B21;&#xFF0C;SSH &#x67B6;&#x8BBE;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x7B80;&#x5355; &#x2014; SSH &#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x5F88;&#x591A;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#x7ECF;&#x9A8C;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x591A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90FD;&#x81EA;&#x5E26;&#x4E86;&#x5B83;&#x6216;&#x8005;&#x76F8;&#x5173;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x3002;&#x518D;&#x6B21;&#xFF0C;&#x901A;&#x8FC7; SSH &#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x662F;&#x5B89;&#x5168;&#x7684; &#x2014; &#x6240;&#x6709;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x90FD;&#x662F;&#x52A0;&#x5BC6;&#x548C;&#x6388;&#x6743;&#x7684;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x548C; Git &#x53CA;&#x672C;&#x5730;&#x534F;&#x8BAE;&#x4E00;&#x6837;&#xFF0C;SSH &#x4E5F;&#x5F88;&#x9AD8;&#x6548;&#xFF0C;&#x4F1A;&#x5728;&#x4F20;&#x8F93;&#x4E4B;&#x524D;&#x5C3D;&#x53EF;&#x80FD;&#x538B;&#x7F29;&#x6570;&#x636E;&#x3002;</p>
<h4 id="&#x7F3A;&#x70B9;-1"><a href="#&#x7F3A;&#x70B9;-1" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h4><p>SSH &#x7684;&#x9650;&#x5236;&#x5728;&#x4E8E;&#x4F60;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x5B83;&#x5B9E;&#x73B0;&#x4ED3;&#x5E93;&#x7684;&#x533F;&#x540D;&#x8BBF;&#x95EE;&#x3002;&#x5373;&#x4F7F;&#x4EC5;&#x4E3A;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x5FC5;&#x987B;&#x5728;&#x80FD;&#x901A;&#x8FC7; SSH &#x8BBF;&#x95EE;&#x4E3B;&#x673A;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x4ED3;&#x5E93;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97; SSH &#x4E0D;&#x5229;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x9879;&#x76EE;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4EC5;&#x4EC5;&#x5728;&#x516C;&#x53F8;&#x7F51;&#x7EDC;&#x91CC;&#x4F7F;&#x7528;&#xFF0C;SSH &#x53EF;&#x80FD;&#x662F;&#x4F60;&#x552F;&#x4E00;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x5982;&#x679C;&#x60F3;&#x5141;&#x8BB8;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x533F;&#x540D;&#x53EA;&#x8BFB;&#x8BBF;&#x95EE;&#xFF0C;&#x90A3;&#x4E48;&#x9664;&#x4E86;&#x4E3A;&#x81EA;&#x5DF1;&#x63A8;&#x9001;&#x800C;&#x67B6;&#x8BBE; SSH &#x534F;&#x8BAE;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x652F;&#x6301;&#x5176;&#x4ED6;&#x534F;&#x8BAE;&#x4EE5;&#x4FBF;&#x4ED6;&#x4EBA;&#x8BBF;&#x95EE;&#x8BFB;&#x53D6;&#x3002;</p>
<h3 id="Git-&#x534F;&#x8BAE;"><a href="#Git-&#x534F;&#x8BAE;" class="headerlink" title="Git &#x534F;&#x8BAE;"></a>Git &#x534F;&#x8BAE;</h3><p>&#x63A5;&#x4E0B;&#x6765;&#x662F; Git &#x534F;&#x8BAE;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x5728; Git &#x8F6F;&#x4EF6;&#x5305;&#x4E2D;&#x7684;&#x7279;&#x6B8A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF1B; &#x5B83;&#x4F1A;&#x76D1;&#x542C;&#x4E00;&#x4E2A;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x4E8E; SSH &#x670D;&#x52A1;&#x7684;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#xFF08;9418&#xFF09;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x6388;&#x6743;&#x3002;&#x6253;&#x7B97;&#x652F;&#x6301; Git &#x534F;&#x8BAE;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x521B;&#x5EFA;<code>git-export-daemon-ok</code> &#x6587;&#x4EF6; &#x2014; &#x5B83;&#x662F;&#x534F;&#x8BAE;&#x8FDB;&#x7A0B;&#x63D0;&#x4F9B;&#x4ED3;&#x5E93;&#x670D;&#x52A1;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6; &#x2014; &#x4F46;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8BE5;&#x670D;&#x52A1;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#x3002;&#x8981;&#x4E48;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x80FD;&#x514B;&#x9686; Git &#x4ED3;&#x5E93;&#xFF0C;&#x8981;&#x4E48;&#x8C01;&#x4E5F;&#x4E0D;&#x80FD;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x534F;&#x8BAE;&#x901A;&#x5E38;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x63A8;&#x9001;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x63A8;&#x9001;&#x64CD;&#x4F5C;&#xFF1B;&#x7136;&#x800C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x6388;&#x6743;&#x673A;&#x5236;&#xFF0C;&#x4E00;&#x65E6;&#x5141;&#x8BB8;&#x8BE5;&#x64CD;&#x4F5C;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x77E5;&#x9053;&#x9879;&#x76EE; URL &#x7684;&#x4EBA;&#x5C06;&#x90FD;&#x6709;&#x63A8;&#x9001;&#x6743;&#x9650;&#x3002;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x5341;&#x5206;&#x7F55;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<h4 id="&#x4F18;&#x70B9;-2"><a href="#&#x4F18;&#x70B9;-2" class="headerlink" title="&#x4F18;&#x70B9;"></a>&#x4F18;&#x70B9;</h4><p>Git &#x534F;&#x8BAE;&#x662F;&#x73B0;&#x5B58;&#x6700;&#x5FEB;&#x7684;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6709;&#x5F88;&#x5927;&#x8BBF;&#x95EE;&#x91CF;&#x7684;&#x516C;&#x5171;&#x9879;&#x76EE;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x8BFB;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x6388;&#x6743;&#x7684;&#x5E9E;&#x5927;&#x9879;&#x76EE;&#xFF0C;&#x67B6;&#x8BBE;&#x4E00;&#x4E2A; Git &#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x6765;&#x4F9B;&#x5E94;&#x4ED3;&#x5E93;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x4E0E; SSH &#x534F;&#x8BAE;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x7701;&#x53BB;&#x4E86;&#x52A0;&#x5BC6;&#x548C;&#x6388;&#x6743;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<h4 id="&#x7F3A;&#x70B9;-2"><a href="#&#x7F3A;&#x70B9;-2" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h4><p>Git &#x534F;&#x8BAE;&#x6D88;&#x6781;&#x7684;&#x4E00;&#x9762;&#x662F;&#x7F3A;&#x5C11;&#x6388;&#x6743;&#x673A;&#x5236;&#x3002;&#x7528; Git &#x534F;&#x8BAE;&#x4F5C;&#x4E3A;&#x8BBF;&#x95EE;&#x9879;&#x76EE;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;&#x4E00;&#x822C;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x4F9B; SSH &#x63A5;&#x53E3;&#xFF0C;&#x8BA9;&#x51E0;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x62E5;&#x6709;&#x63A8;&#x9001;&#xFF08;&#x5199;&#xFF09;&#x6743;&#x9650;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x901A;&#x8FC7;<code>git://</code> &#x62E5;&#x6709;&#x53EA;&#x8BFB;&#x6743;&#x9650;&#x3002;Git &#x534F;&#x8BAE;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x6700;&#x96BE;&#x67B6;&#x8BBE;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x5B83;&#x8981;&#x6C42;&#x6709;&#x5355;&#x72EC;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x5B9A;&#x5236; &#x2014; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7684; &#x201C;<code>Gitosis</code>&#x201D; &#x4E00;&#x8282;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5B83;&#x7684;&#x67B6;&#x8BBE; &#x2014; &#x9700;&#x8981;&#x8BBE;&#x5B9A;xinetd &#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x8F7B;&#x677E;&#x4E86;&#x3002;&#x8BE5;&#x534F;&#x8BAE;&#x8FD8;&#x8981;&#x6C42;&#x9632;&#x706B;&#x5899;&#x5F00;&#x653E; 9418 &#x7AEF;&#x53E3;&#xFF0C;&#x800C;&#x4F01;&#x4E1A;&#x7EA7;&#x9632;&#x706B;&#x5899;&#x4E00;&#x822C;&#x4E0D;&#x5141;&#x8BB8;&#x5BF9;&#x8FD9;&#x4E2A;&#x975E;&#x6807;&#x51C6;&#x7AEF;&#x53E3;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x7EA7;&#x9632;&#x706B;&#x5899;&#x901A;&#x5E38;&#x4F1A;&#x5C01;&#x9501;&#x8FD9;&#x4E2A;&#x5C11;&#x89C1;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<h3 id="HTTP-S-&#x534F;&#x8BAE;"><a href="#HTTP-S-&#x534F;&#x8BAE;" class="headerlink" title="HTTP/S &#x534F;&#x8BAE;"></a>HTTP/S &#x534F;&#x8BAE;</h3><p>&#x6700;&#x540E;&#x8FD8;&#x6709; HTTP &#x534F;&#x8BAE;&#x3002;HTTP &#x6216; HTTPS &#x534F;&#x8BAE;&#x7684;&#x4F18;&#x7F8E;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x67B6;&#x8BBE;&#x7684;&#x7B80;&#x4FBF;&#x6027;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x628A; Git &#x7684;&#x88F8;&#x4ED3;&#x5E93;&#x6587;&#x4EF6;&#x653E;&#x5728; HTTP &#x7684;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x914D;&#x7F6E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;<code>post-update</code> &#x6302;&#x94A9;&#xFF08;hook&#xFF09;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#xFF08;Git &#x6302;&#x94A9;&#x7684;&#x7EC6;&#x8282;&#x89C1;&#x7B2C; 7 &#x7AE0;&#xFF09;&#x3002;&#x6B64;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x80FD;&#x8BBF;&#x95EE; Git &#x4ED3;&#x5E93;&#x6240;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A; web &#x670D;&#x52A1;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x514B;&#x9686;&#x64CD;&#x4F5C;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x901A;&#x8FC7; HTTP &#x5BF9;&#x4ED3;&#x5E93;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ cd /var/www/htdocs/</span><br><span class="line">$ git clone --bare /path/to/git_project gitproject.git</span><br><span class="line">$ cd gitproject.git</span><br><span class="line">$ mv hooks/post-update.sample hooks/post-update</span><br><span class="line">$ chmod a+x hooks/post-update</span><br></pre></td></tr></table></figure>
<p>&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;Git &#x9644;&#x5E26;&#x7684; <code>post-update</code> &#x6302;&#x94A9;&#x4F1A;&#x9ED8;&#x8BA4;&#x8FD0;&#x884C;&#x5408;&#x9002;&#x7684;&#x547D;&#x4EE4;&#xFF08;<code>git update-server-info</code>&#xFF09;&#x6765;&#x786E;&#x4FDD;&#x901A;&#x8FC7; HTTP &#x7684;&#x83B7;&#x53D6;&#x548C;&#x514B;&#x9686;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x5728;&#x4F60;&#x7528; SSH &#x5411;&#x4ED3;&#x5E93;&#x63A8;&#x9001;&#x5185;&#x5BB9;&#x65F6;&#x8FD0;&#x884C;&#xFF1B;&#x4E4B;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x6765;&#x514B;&#x9686;&#x4ED3;&#x5E93;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">$ git clone http://example.com/gitproject.git</span><br></pre></td></tr></table></figure>
<p>&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86; Apache &#x8BBE;&#x5B9A;&#x4E2D;&#x5E38;&#x7528;&#x7684; <code>/var/www/htdocs</code> &#x8DEF;&#x5F84;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x9759;&#x6001; web &#x670D;&#x52A1; &#x2014; &#x628A;&#x88F8;&#x4ED3;&#x5E93;&#x653E;&#x5728;&#x5B83;&#x7684;&#x76EE;&#x5F55;&#x91CC;&#x5C31;&#x884C;&#x3002; Git &#x7684;&#x6570;&#x636E;&#x662F;&#x4EE5;&#x6700;&#x57FA;&#x672C;&#x7684;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#x63D0;&#x4F9B;&#x7684;&#xFF08;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x6587;&#x4EF6;&#x7684;&#x8BE6;&#x60C5;&#x89C1;&#x7B2C; 9 &#x7AE0;&#xFF09;&#x3002;</p>
<p>&#x901A;&#x8FC7; HTTP &#x8FDB;&#x884C;&#x63A8;&#x9001;&#x64CD;&#x4F5C;&#x4E5F;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4E0D;&#x592A;&#x5E38;&#x89C1;&#xFF0C;&#x5E76;&#x4E14;&#x7275;&#x626F;&#x5230;&#x590D;&#x6742;&#x7684; WebDAV &#x8BBE;&#x5B9A;&#x3002;&#x7531;&#x4E8E;&#x5F88;&#x5C11;&#x7528;&#x5230;&#xFF0C;&#x672C;&#x4E66;&#x5C06;&#x7565;&#x8FC7;&#x5BF9;&#x8BE5;&#x5185;&#x5BB9;&#x7684;&#x8BA8;&#x8BBA;&#x3002;&#x5982;&#x679C;&#x5BF9; HTTP &#x63A8;&#x9001;&#x534F;&#x8BAE;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E0D;&#x59A8;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x770B;&#x4E00;&#x4E0B;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#xFF1A;<a href="http://www.kernel.org/pub/software/scm/git/docs/howto/setup-git-server-over-http.txt" target="_blank" rel="external">http://www.kernel.org/pub/software/scm/git/docs/howto/setup-git-server-over-http.txt</a> &#x3002;&#x901A;&#x8FC7; HTTP &#x63A8;&#x9001;&#x7684;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55; WebDAV &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E3A; Git &#x8BBE;&#x5B9A;&#x7279;&#x6B8A;&#x73AF;&#x5883;&#xFF1B;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4E3B;&#x673A;&#x63D0;&#x4F9B;&#x5546;&#x652F;&#x6301;&#x901A;&#x8FC7; WebDAV &#x66F4;&#x65B0;&#x7F51;&#x7AD9;&#x5185;&#x5BB9;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x9879;&#x529F;&#x80FD;&#x3002;</p>
<h4 id="&#x4F18;&#x70B9;-3"><a href="#&#x4F18;&#x70B9;-3" class="headerlink" title="&#x4F18;&#x70B9;"></a>&#x4F18;&#x70B9;</h4><p>&#x4F7F;&#x7528; HTTP &#x534F;&#x8BAE;&#x7684;&#x597D;&#x5904;&#x662F;&#x6613;&#x4E8E;&#x67B6;&#x8BBE;&#x3002;&#x51E0;&#x6761;&#x5FC5;&#x8981;&#x7684;&#x547D;&#x4EE4;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x5168;&#x4E16;&#x754C;&#x8BFB;&#x53D6;&#x5230;&#x4ED3;&#x5E93;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x82B1;&#x8D39;&#x4E0D;&#x8FC7;&#x51E0;&#x5206;&#x949F;&#x3002;HTTP &#x534F;&#x8BAE;&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x8FC7;&#x591A;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x4E00;&#x822C;&#x53EA;&#x7528;&#x5230;&#x9759;&#x6001;&#x7684; HTTP &#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x666E;&#x901A;&#x7684; Apache &#x670D;&#x52A1;&#x5668;&#x5E73;&#x5747;&#x6BCF;&#x79D2;&#x80FD;&#x652F;&#x6491;&#x6570;&#x5343;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5E76;&#x53D1;&#x8BBF;&#x95EE; &#x2014; &#x54EA;&#x6015;&#x8BA9;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x670D;&#x52A1;&#x5668;&#x8D85;&#x8F7D;&#x90FD;&#x5F88;&#x96BE;&#x3002;</p>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; HTTPS &#x63D0;&#x4F9B;&#x53EA;&#x8BFB;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#x5185;&#x5BB9;&#xFF1B;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x7B7E;&#x540D;&#x7684; SSL &#x8BC1;&#x4E66;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x5230;&#x4E86;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x4F7F;&#x7528; SSH &#x516C;&#x5171;&#x5BC6;&#x94A5;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6848;&#xFF1B;&#x4E0D;&#x8FC7;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x65F6;&#x901A;&#x8FC7; HTTPS &#x4F7F;&#x7528;&#x5E26;&#x7B7E;&#x540D;&#x7684; SSL &#x8BC1;&#x4E66;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x57FA;&#x4E8E; HTTP &#x7684;&#x53EA;&#x8BFB;&#x8FDE;&#x63A5;&#x6388;&#x6743;&#x65B9;&#x5F0F;&#x662F;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>HTTP &#x8FD8;&#x6709;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x597D;&#x5904;&#xFF1A;HTTP &#x662F;&#x4E00;&#x4E2A;&#x5982;&#x6B64;&#x5E38;&#x89C1;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4F01;&#x4E1A;&#x7EA7;&#x9632;&#x706B;&#x5899;&#x901A;&#x5E38;&#x90FD;&#x5141;&#x8BB8;&#x5176;&#x7AEF;&#x53E3;&#x7684;&#x901A;&#x4FE1;&#x3002;</p>
<h4 id="&#x7F3A;&#x70B9;-3"><a href="#&#x7F3A;&#x70B9;-3" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h4><p>HTTP &#x534F;&#x8BAE;&#x7684;&#x6D88;&#x6781;&#x9762;&#x5728;&#x4E8E;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x5BA2;&#x6237;&#x7AEF;&#x6548;&#x7387;&#x66F4;&#x4F4E;&#x3002;&#x514B;&#x9686;&#x6216;&#x8005;&#x4E0B;&#x8F7D;&#x4ED3;&#x5E93;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14; HTTP &#x4F20;&#x8F93;&#x7684;&#x4F53;&#x79EF;&#x548C;&#x7F51;&#x7EDC;&#x5F00;&#x9500;&#x6BD4;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x534F;&#x8BAE;&#x90FD;&#x5927;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;&#x6309;&#x9700;&#x4F9B;&#x5E94;&#x7684;&#x80FD;&#x529B; &#x2014; &#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CA1;&#x6709;&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x52A8;&#x6001;&#x8BA1;&#x7B97; &#x2014; &#x56E0;&#x800C; HTTP &#x534F;&#x8BAE;&#x7ECF;&#x5E38;&#x4F1A;&#x88AB;&#x79F0;&#x4E3A;<em>&#x50BB;&#x74DC;&#xFF08;dumb&#xFF09;</em>&#x534F;&#x8BAE;&#x3002;</p>

      
    </div>
    
    <div>
      
        
      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Git/" rel="tag">#Git</a>
          
            <a href="/tags/协议/" rel="tag">#协议</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/04/27/清理MacPorts/" rel="next" title="清理MacPorts">
                <i class="fa fa-chevron-left"></i> 清理MacPorts
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/04/28/Android-studio-多渠道打包/" rel="prev" title="Android studio 多渠道打包">
                Android studio 多渠道打包 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>


<script>
    window.onload =function(){
        var qrcode = new QRCode(document.getElementById("qrcode"), {
            width : 96,//设置宽高
            height : 96
        });
        qrcode.makeCode("http://blog.kuleyang.com/2016/04/28/Git传输协议介绍/");
    }

</script>




    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/04/28/Git传输协议介绍/"
           data-title="Git传输协议介绍" data-url="http://blog.kuleyang.com/2016/04/28/Git传输协议介绍/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/default_avatar.jpg"
               alt="Kule Yang" />
          <p class="site-author-name" itemprop="name">Kule Yang</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">32</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">72</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#本地协议"><span class="nav-number">1.</span> <span class="nav-text">本地协议</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#优点"><span class="nav-number">1.1.</span> <span class="nav-text">优点</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#缺点"><span class="nav-number">1.2.</span> <span class="nav-text">缺点</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#SSH-协议"><span class="nav-number">2.</span> <span class="nav-text">SSH 协议</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#优点-1"><span class="nav-number">2.1.</span> <span class="nav-text">优点</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#缺点-1"><span class="nav-number">2.2.</span> <span class="nav-text">缺点</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#Git-协议"><span class="nav-number">3.</span> <span class="nav-text">Git 协议</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#优点-2"><span class="nav-number">3.1.</span> <span class="nav-text">优点</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#缺点-2"><span class="nav-number">3.2.</span> <span class="nav-text">缺点</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#HTTP-S-协议"><span class="nav-number">4.</span> <span class="nav-text">HTTP/S 协议</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#优点-3"><span class="nav-number">4.1.</span> <span class="nav-text">优点</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#缺点-3"><span class="nav-number">4.2.</span> <span class="nav-text">缺点</span></a></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Kule Yang</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/qrcode.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"kuleyang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
